docs: fix workflow diagrams
